[Strategy.GP_AvatarAutopsyScreen X2NarrativeMoment]
UIHeaderText="Examine the Recovered Avatar Corpse"
UIBodyText="Use the Shadow Chamber to study the corpse of the summoned Avatar being that was killed in combat by XCOM forces."
UIArrayText[0]="Complete the Avatar Autopsy Shadow Project"

[Strategy.GP_BroadcastTheTruthScreen X2NarrativeMoment]
UIHeaderText="Assault the ADVENT Network Tower"
UIBodyText="Launch an infiltration mission on the main ADVENT Network tower, attempting a shut down of the global ADVENT communication network and disrupting ADVENT's worldwide control."
UIArrayText[0]="Complete the ADVENT Network Tower Mission"

[Strategy.GP_BuildShadowChamberScreen X2NarrativeMoment]
UIHeaderText="Build the Shadow Chamber"
UIBodyText="Build the Shadow Chamber facility in the Avenger."
UIArrayText[0]="Construct the Shadow Chamber Facility"

[Strategy.GP_BuildStasisSuitScreen X2NarrativeMoment]
UIHeaderText="Examine the ADVENT Stasis Suit"
UIBodyText="Use the Shadow Chamber to study the Stasis Suit recovered from the ADVENT Forge facility."
UIArrayText[0]="Complete the Stasis Suit Shadow Project"

[Strategy.GP_CaptainAutopsyScreen X2NarrativeMoment]
UIHeaderText="Examine an ADVENT Officer Corpse"
UIBodyText="Have Dr. Tygan perform an ADVENT Officer autopsy in the research labs."
UIArrayText[0]="Complete the ADVENT Officer Autopsy Research"

[Strategy.GP_ConstructPsiGateScreen X2NarrativeMoment]
UIHeaderText="Examine the Psionic Gate"
UIBodyText="Install the recovered Psionic Gate in the Shadow Chamber, allowing a detailed study of the Gate and where it might lead."
UIArrayText[0]="Upgrade the Shadow Chamber"
UIArrayText[1]="Complete the Psionic Gate Shadow Project"

[Strategy.GP_ContactBlacksiteRegionScreen X2NarrativeMoment]
UIHeaderText="Contact the Resistance in the Blacksite Region"
UIBodyText="Make contact with the local resistance in the Blacksite region in order to gain access to the ADVENT facility."
UIArrayText[0]="Research Resistance Communications"
UIArrayText[1]="Fly to the Blacksite Region"
UIArrayText[2]="Make Contact"

[Strategy.GP_FinalMissionScreen X2NarrativeMoment]
UIHeaderText="Assault the Alien Fortress"
UIBodyText="Send the Commander and a squad of soldiers through the Psionic Gate to the aliens' seat of power and destroy the Elders' hold on Earth for good."
UIArrayText[0]="Complete the Alien Fortress Mission"

[Strategy.GP_ForgeMissionScreen X2NarrativeMoment]
UIHeaderText="Investigate the Blacksite Vial Coordinates"
UIBodyText="After making contact with local resistance in the region, investigate the facility at the map coordinates recovered from the Blacksite vial."
UIArrayText[0]="Complete the Blacksite Vial Coordinates Mission"

[Strategy.GP_HackACaptainScreen X2NarrativeMoment]
UIHeaderText="Access the Alien Network"
UIBodyText="Use the Skulljack item on an ADVENT Officer in combat to gain access to the alien communication network."
UIArrayText[0]="Construct the Proving Ground Facility"
UIArrayText[1]="Complete the Skulljack Project in the Proving Ground"
UIArrayText[2]="Use the Skulljack on an ADVENT Officer"

[Strategy.GP_HackACodexScreen X2NarrativeMoment]
UIHeaderText="Breach the Alien Network"
UIBodyText="Use the Skulljack item on a Codex alien in combat to gain access to restricted data from the Avatar Project."
UIArrayText[0]="Use the Skulljack on a Codex"

[Strategy.GP_InvestigateBlacksiteScreen X2NarrativeMoment]
UIHeaderText="Investigate the ADVENT Blacksite"
UIBodyText="The mysterious ADVENT Blacksite must be investigated by an XCOM strike team, and any relevant artifacts must be recovered for study."
UIArrayText[0]="Complete the ADVENT Blacksite Mission"

[Strategy.GP_PsiGateMissionScreen X2NarrativeMoment]
UIHeaderText="Investigate the Codex Brain Coordinates"
UIBodyText="After making contact with local resistance in the region, investigate the map coordinates recovered from the Codex brain."
UIArrayText[0]="Complete the Codex Brain Coordinates Mission"

[Strategy.GP_ResearchAlienEncryptionScreen X2NarrativeMoment]
UIHeaderText="Research Alien Encryption"
UIBodyText="Have Dr. Tygan complete research into the aliens' encryption methods."
UIArrayText[0]="Complete the Alien Encryption Research"

[Strategy.GP_StudyBlacksiteDataScreen X2NarrativeMoment]
UIHeaderText="Examine the Recovered Blacksite Vial"
UIBodyText="Examine the Recovered Blacksite Vial"
UIArrayText[0]="Examine the Recovered Blacksite Vial"

[Strategy.GP_StudyCodexBrainPt2Screen X2NarrativeMoment]
UIHeaderText="Decrypt Codex Data"
UIBodyText="Use the Shadow Chamber to decrypt the remaining Codex data."
UIArrayText[0]="Complete the Encrypted Codex Data Shadow Project"

[Strategy.GP_StudyCodexBrainScreen X2NarrativeMoment]
UIHeaderText="Examine the Codex Brain"
UIBodyText="Use the Shadow Chamber to examine the recovered Codex brain."
UIArrayText[0]="Study the Codex"
UIArrayText[1]="Decrypt Codex Data"

